# 과제1
# 유저 클래스에 아래의 함수를 구현하세요
# def add_following(self, user):
# def delete_following(self, name_of_user):
# def show_all_followings(self):
# def get_count_of_followings(self):
# def show_all_followers(self):
# def get_count_of_followers(self):
# 인플루언서와 광고주 클래스 아래의 introduce_myself 함수를 적당히 구현하세요

# 시즌1 최종 과제
# 그 어떤 경우에도 프로그램이 종료되어서는 안됩니다. 에러가 나도 프로그램이 계속 실행되도록 하세요
# 콘솔에 "입력모드(1), 시험모드(2), 프로그램 종료(0) 중 하나를 선택하세요: " 라고 출력된다
# 입력 모드의 경우 콘솔에 "영단어를 입력하세요: " 라고 출력된다
# 사용자가 영단어를 입력하면 콘솔에 "한글 뜻도 입력하세요: " 라고 출력된다
# 반복적으로 입력받는다
# "영단어를 입력하세요: " 에서 사용자가 exit를 입력하면
# voca.csv라는 텍스트 파일이 생성되며, 생성된 파일 내에는
# apple 사과
# school 학교
# 이와 같은 형태로 사용자의 입력이 저장되고
# "입력모드(1), 시험모드(2), 프로그램 종료(3) 중 하나를 선택하세요: " 로 되돌아간다
# 시험 모드의 경우 voca.csv의 파일을 읽어서 랜덤하게
# 콘솔에 "apple의 뜻을 쓰세요: " 라고 출력된다
# 한글 뜻을 사용자가 입력한 경우
# 맞았다면 "맞았습니다!" 라고 출력하고 다른 단어를 질문한다
# 틀렸다면 "틀렸습니다!" 라고 출력하고 다른 단어를 질문한다
# 시험 끝 이라고 입력하면 "입력모드(1), 시험모드(2), 프로그램 종료(3) 중 하나를 선택하세요: " 로 되돌아간다
# 프로그래밍 종료를 선택하면 프로그램이 종료된다
